src/DataProcessors/zoho.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>zoho</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Documents/SalesOrder.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>SalesOrder</Name>
			<BasedOn>
				<xr:Item>Document.Quote</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.OrderTransactions</xr:Item>
				<xr:Item>AccumulationRegister.OrdersRegistered</xr:Item>
				<xr:Item>InformationRegister.OrdersStatuses</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShipTo</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Addresses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BillTo</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Addresses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ConfirmTo</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Addresses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RefNum</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DropshipCompany</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DropshipShipTo</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Addresses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DropshipConfirmTo</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Addresses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DropshipRefNum</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesPerson</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesPeople</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Locations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeliveryDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Project</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Projects</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Class</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Classes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ManualAdjustment</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LineSubtotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountPercent</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Discount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Shipping</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesTax</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesTaxRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotalRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>______Review______</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NewObject</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CF1String</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesTaxRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SalesTaxRates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountIsTaxable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesTaxAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TaxableSubtotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailNote</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalMemo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailTo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailCC</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LastEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Terms</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentTerms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Quote</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Product</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Products</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ProductDescription</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UnitSet</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.UnitSets</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QtyUnits</Name>
							<Comment>Quantity in item units (Unit)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Unit</Name>
							<Comment>Item unit</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Units</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>QtyUM</Name>
							<Comment>Quantity in base units (UM)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UM</Name>
							<Comment>Base unit</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.UM</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PriceUnits</Name>
							<Comment>Price for the item unit (Units)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PriceUM</Name>
							<Comment>Price for base unit (UM)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LineTotal</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Taxable</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TaxableAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Location</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Locations</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DeliveryDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Project</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Projects</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Class</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Classes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SalesTaxAcrossAgencies</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Agency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SalesTaxAgencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Rate</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SalesTaxRate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SalesTaxRates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SalesTaxComponent</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SalesTaxComponents</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/zoho/Forms/Form/Ext/Form/Module.bsl
&AtClient
Procedure SendRequest(Command)
	ShowMessageBox(Undefined, SendRequestAtServer());
EndProcedure

&AtServer
Function SendRequestAtServer()
	
	// Set request parameters.
	RequestParameters = New Structure;
	RequestParameters.Insert("authtoken", Constants.zoho_auth_token.Get());
	RequestParameters.Insert("scope",     "crmapi");
	RequestParameters.Insert("id",        "731865000000332074");
	
	// Apply parameters to the connection settings (override URL).
	ConnectionSettings = New Structure("Parameters, ParametersDecoded");
	ConnectionSettings.Parameters        = InternetConnectionClientServer.EncodeQueryData(RequestParameters);
	ConnectionSettings.ParametersDecoded = RequestParameters;
	
	// Define CA certificate.
	SecureConnection = Undefined; // Here CA certificate must be applied!
	
	// Create HTTP secure connection.
	Connection = InternetConnectionClientServer.CreateConnection("https://crm.zoho.com/crm/private/json/SalesOrders/getRecordById", ConnectionSettings, SecureConnection).Result;
	
	// Send request and get server response.
	Response = InternetConnectionClientServer.SendRequest(Connection, "Get", ConnectionSettings).Result;
	
	// Decode JSON data.
	JSON = InternetConnectionClientServer.DecodeJSON(Response);
	
	Header = JSON.response.result.SalesOrders.row.FL;
	NumOfRows = Header.Count();
	Lines = New Structure();
	For i = 0 To NumOfRows - 1 Do
		test = Header[i].val;
		If Header[i].val = "Product Details" Then
			Lines = Header[i];
		ElsIf Header[i].val = "SO Number" Then
			so_number = Header[i].content;
		ElsIf Header[i].val = "Account Name" Then
			account_name = Header[i].content;
		ElsIf Header[i].val = "Created Time" Then
			created_time = Header[i].content;
		ElsIf Header[i].val = "Grand Total" Then
			grand_total = Number(Header[i].content);
		EndIf
	EndDo;
	Customer = Catalogs.Companies.FindByDescription(account_name);
	Lines = Lines.product;
	
	NewSO = Documents.SalesOrder.CreateDocument();
	NewSO.Company = Customer;
	//NewSO.CompanyCode = Customer.Code;
	NewSO.Date = created_time;
	NewSO.Location = Catalogs.Locations.MainWarehouse;
	NewSO.DocumentTotal = grand_total;
	NewSO.DocumentTotalRC = grand_total;
	Query = New Query("SELECT
	                  |	Addresses.Ref
	                  |FROM
	                  |	Catalog.Addresses AS Addresses
	                  |WHERE
	                  |	Addresses.Owner = &Customer
	                  |	AND Addresses.DefaultShipping = True");
	Query.SetParameter("Customer", Customer);
	Dataset = Query.Execute().Unload();
	NewSO.ShipTo = Dataset[0][0];
	NewSO.ExchangeRate = 1;
	NewSO.Memo = so_number;
	NewSO.Currency = Constants.DefaultCurrency.Get();
	
	NumOfLines = Lines.Count();
	For i = 0 To NumOfLines - 1 Do
		ProductLine = Lines[i].FL;
		
		PLRows = ProductLine.Count();
			For z = 0 To PLRows - 1 Do
			test = ProductLine[z].val;
			If ProductLine[z].val = "Product Name" Then
				product_name = ProductLine[z].content;
			ElsIf ProductLine[z].val = "Quantity" Then
				qty = Number(ProductLine[z].content);
			ElsIf ProductLine[z].val = "List Price" Then
				list_price = Number(ProductLine[z].content);
			EndIf;
				
		EndDo;
		
		SOLine = NewSO.LineItems.Add();
		SOLine.Product = Catalogs.Products.FindByCode(product_name);
		SOLine.ProductDescription = SOLine.Product.Description;
		SOLine.Price = list_price;
		SOLine.Quantity = qty;
		SOLine.LineTotal = list_price * qty;
		SOLine.SalesTaxType = US_FL.GetSalesTaxType(SOLine.Product);
		SOLine.VATCode = CommonUse.GetAttributeValue(SOLine.Product, "SalesVATCode");
	
	EndDo;
	
	NewSO.Write();
	
	
	// Display response to the user.
	//Return Response;
	
EndFunction
